Importing required libraries

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# Read the books dataset

In [2]:
users_data=pd.read_csv(r'BX-Users.csv',encoding='Latin-1')

In [3]:
users_data.head()

  user_id                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

Checking shape of dataset

In [4]:
users_data.shape

(278859, 3)

Check for null values

In [5]:
users_data.isnull().sum()

user_id          0
Location         1
Age         110763
dtype: int64

Replacing null values with zero in column age to avoid lose of valuable data

In [6]:
users_data['Age'].fillna(0,inplace=True)

In [7]:
users_data.isnull().sum()

user_id     0
Location    1
Age         0
dtype: int64

# Clean up NaN values
Dropping null values

In [8]:
users_data1=users_data.dropna()

In [9]:
users_data1.isnull().sum()

user_id     0
Location    0
Age         0
dtype: int64

Reading books data

In [10]:
book_data=pd.read_csv(r"BX-Books.csv",encoding="latin-1")

In [11]:
book_data.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [12]:
book_data.isnull().any()

isbn                   False
book_title             False
book_author             True
year_of_publication    False
publisher               True
dtype: bool

In [13]:
book_data.isnull().sum()

isbn                   0
book_title             0
book_author            1
year_of_publication    0
publisher              2
dtype: int64

In [14]:
book_data1=book_data.dropna()

In [15]:
book_data1.isnull().any()

isbn                   False
book_title             False
book_author            False
year_of_publication    False
publisher              False
dtype: bool

# Read the data where ratings are given by users

(reading only first 10000 rows to avoid memory issue)

In [16]:
book_ratings=pd.read_csv(r"BX-Book-Ratings.csv",encoding='latin-1', nrows=10000)

In [17]:
book_ratings.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726   155061224       5
2   276727   446520802       0
3   276729  052165615X       3
4   276729   521795028       6

In [18]:
book_ratings.isnull().any()

user_id    False
isbn       False
rating     False
dtype: bool

In [19]:
book_ratings.describe()

             user_id        rating
count   10000.000000  10000.000000
mean   265844.379600      1.974700
std     56937.189618      3.424884
min         2.000000      0.000000
25%    277478.000000      0.000000
50%    278418.000000      0.000000
75%    278418.000000      4.000000
max    278854.000000     10.000000

Merging the dataframes

In [20]:
Dataframe=pd.merge(book_ratings,book_data1, on='isbn')

In [21]:
Dataframe.head()

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
1,276726,155061224,5,Rites of Passage,Judith Rae,2001,Heinle
2,276727,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books
3,278418,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books
4,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press

# Take a quick look at the number of unique users and books

In [22]:
n_users=Dataframe.user_id.nunique()
n_books=Dataframe.isbn.nunique()

In [23]:
print("Number of users:",str(n_users))
print("Number of books:",str(n_books))

Number of users: 828
Number of books: 8051

# Convert ISBN variables to numeric numbers in the correct order

In [24]:
isbnLIST=Dataframe.isbn.unique()

In [25]:
isbnLIST

array(['034545104X', '155061224', '446520802', ..., '425098834',
       '425163407', '425164403'], dtype=object)

In [26]:
print('Length of isbn list', len(isbnLIST))

Length of isbn list 8051

In [27]:
def get_isbn_numeric_id(isbn):
    item_index=np.where(isbnLIST==isbn)
    return item_index[0][0]

# Convert the user_id variable to numeric numbers in the correct order

In [28]:
userid_list=Dataframe.user_id.unique()

In [29]:
userid_list

array([276725, 276726, 276727, 278418, 276729, 276733, 276744, 276746,
       277427, 278026, 276747, 278843, 276748, 276751, 276754, 276964,
       276755,     99, 276762, 276772, 276774, 276780, 276786, 276788,
       278356, 276796, 277195,    232, 276798, 277375, 276800, 278100,
       276804, 276808, 276811, 276904, 278314, 276813, 276814, 276817,
       276820, 276822, 278554, 276828, 277681, 276830, 276832, 277143,
       276833, 276835, 276837, 276838, 276840, 278633, 276847, 276861,
       276848, 276936, 276850, 277639, 276852, 276853, 276854, 276856,
       276859, 276862, 276866, 278778, 278249, 276869, 278251, 276872,
       276875, 277712, 276878, 276884, 276887, 276888, 276889, 277523,
       277710, 276890, 276896, 278194, 276905, 276911, 276912, 276915,
       276916, 276925, 277623, 277923, 277413, 277439, 277752, 277965,
          243, 277589, 277648, 277689, 278137, 278221, 278390,     67,
       276939, 276954, 277042, 277157, 277378, 277478, 277530, 277932,
       278176, 278373, 278514,     14,    193,    242,     68, 276927,
       276928, 276929, 277253, 278675, 277882, 278162, 278637, 276949,
       276950, 276953, 277743,     26, 276957, 278582, 276963, 278774,
       276975, 276984, 278188, 277791, 276986, 276988, 276989, 276994,
       278563, 276997, 276998, 277002, 277009, 277010, 277622, 277012,
       278825, 277018, 277019, 277023, 277028, 277031, 277032, 277035,
       277036, 277040, 277928, 278483, 278773, 278535, 277466, 278220,
       277048, 277051, 277053, 277056, 277065, 277072, 277073, 277079,
       277085, 277087, 277094, 277096, 277107, 277109, 277114, 277116,
       277123,    236, 277124, 278079, 278096, 277261, 277525, 277629,
       278698, 277128, 277134, 277135, 277139, 277142, 277155, 278346,
       278144, 277165, 277168, 277922, 278333,     51, 277170, 278740,
       278019, 277171, 278259, 278501, 277595, 277722, 278769, 277179,
       277838, 277180, 277183, 277929, 277186, 277187, 278565,    135,
       277188, 277189, 278529, 277641,     23, 278422, 277469, 278552,
       277915, 278243, 278342, 277832, 277196, 277197, 277235, 277203,
       278238, 277205, 277212, 277411, 277220, 277228, 277229, 277230,
       277231, 277962, 277237, 277240, 277242, 277243, 277244, 277807,
       277245, 277535, 278007, 277246, 277517, 277901, 278075, 277256,
       277257, 277262, 277265, 277269, 277271, 277272, 277274, 277281,
       277284, 277285, 277288, 277291, 277292, 277293, 277314, 277315,
       278692,    165, 277317, 277330, 277338, 277340, 277341, 277343,
       277348, 277351, 277353, 277359, 277363, 277959, 277364, 277367,
       277374, 277462, 277937, 278350, 278556, 277879, 277379, 277380,
       277388, 277389, 277397, 277400, 277402, 277405, 277408, 277424,
           75, 277803, 277958, 278541, 278798, 278048, 278202, 278469,
       277744, 277776, 277812, 277502, 277756, 277798, 277987, 277764,
       278465, 278672, 278503, 277432, 277433, 277434, 277435, 277436,
       278524, 278254,    114, 277444, 277453, 277457, 278854, 278014,
       277470, 277471, 277473, 277474, 278536,      9, 277691, 278723,
       277554,     39, 278559, 278832, 277479, 277486, 277488, 277506,
       277508, 277509, 277513, 277514, 277518, 277519, 277662, 277526,
       277527, 277528, 277529, 277790, 277532, 277533, 277538, 277544,
       277547, 277548, 278008, 278525, 277556, 277559, 277560, 277562,
       277563, 277565, 277568, 277569, 278819, 277574, 277575, 278431,
       277579, 277585, 277586, 277588, 277594, 277596, 277598, 277601,
       277605, 277610, 277619, 277627, 277632, 277633, 277636, 278002,
       277877, 277705, 278325, 277954, 278257, 278361, 277646, 277647,
       277945, 277650, 277651, 278522, 277657, 277660, 277665, 277680,
       277682, 277687, 277696, 277697, 277698,     91, 277700, 277701,
       277706, 278177, 277711, 277714, 277720, 277727, 277728, 277737,
       277740, 277746, 277748, 277759, 277761, 277765, 277808, 277767,
       277768, 277769, 277774, 277775, 277777, 277778, 278663, 277779,
       277781, 277782, 277783, 277827, 277828,    185, 277784, 277786,
       277787, 277814, 277788, 277793, 277794, 277795, 277797, 277799,
       277800, 277801, 277802, 277809, 277811, 277813, 277824, 277823,
       277844, 277816, 277817, 277818, 277819, 277820, 277825, 277826,
       277830, 277831, 277833, 277834, 277835, 277837, 277840, 277841,
       277842, 277843, 277845, 277864, 277872, 277873, 277884, 277888,
       277997, 277891, 277892, 277894, 277895, 277898, 277938, 277903,
       277904, 277908, 277909, 277911, 277913, 277918, 277919, 277921,
       278755,     95,    125, 277930, 278694, 277946, 277953, 277964,
           16, 277969, 277975, 277978, 277982, 277984, 277988, 277989,
       277992, 277996, 277998,    207, 278683, 278009, 278012, 278017,
       278020, 278021, 278022, 278023, 278024, 278030, 278034, 278043,
       278044, 278054, 278056, 278058, 278063, 278064, 278065, 278066,
       278069, 278070, 278074, 278534, 278085, 278089, 278092, 278094,
       278095, 278098, 278104, 278106, 278107, 278543, 278110, 278111,
       278112, 278117, 278119, 278120, 278122, 278131, 278545, 278586,
       278653, 278139, 278140, 278181, 278148, 278149, 278153, 278561,
       278155, 278156, 278158, 278159, 278160, 278161, 278167, 278168,
       278172, 278183, 278184, 278185,     44, 278411, 278193, 278263,
       278197, 278199, 278200,    224, 278203, 278204, 278207, 278209,
       278212, 278213, 278215, 278216, 278218, 278224, 278227, 278235,
       278237, 278244, 278245, 278246, 278248, 278250, 278253, 278255,
       278260, 278264, 278270, 278274, 278279, 278280, 278297, 278300,
       278302, 278307, 278311, 278316, 278319, 278328, 278330, 278334,
       278336,    144, 278345, 278355, 278357, 278358, 278364, 278365,
       278368, 278376, 278377, 278378, 278388, 278389, 278394, 278396,
       278398, 278400, 278401, 278409, 278452, 278849, 278506,    169,
       278648, 278767, 278539,     17, 278641,     69, 278432, 278435,
       278439, 278444, 278446, 278449, 278450, 278458, 278459, 278461,
       278462, 278466, 278474, 278475, 278479, 278487, 278488, 278490,
       278491, 278492, 278500, 278510, 278512, 278515, 278520, 278528,
       278531, 278533, 278813, 278537, 278538, 278540, 278542, 278550,
       278551, 278568, 278569, 278571, 278573, 278836, 278597, 278601,
       278610, 278615, 278620, 278621, 278634, 278636, 278644, 278645,
       278650, 278652, 278659, 278665, 278668, 278669, 278681, 278710,
       278713, 278714, 278715, 278720, 278721, 278724, 278729, 278731,
       278732, 278747, 278750, 278752, 278759, 278760, 278771, 278772,
       278777, 278781, 278782, 278784, 278786, 278788, 278789, 278795,
       278796, 278800, 278807, 278815, 278818, 278820, 278824, 278828,
       278831, 278838, 278844, 278846, 278851, 278852,      2,      8,
           10,     12,     19,     20,     22,     32,     36,     42,
           53,     56,     64,     70,     73,     77,     78,     79,
           81,     82,     83,     85,     86,     87,     88,     92,
           97,    102,    107,    109,    110,    129,    132,    133,
          139,    141,    151,    160,    162,    176,    178,    183,
          190,    199,    202,    204,    212,    215,    217,    226,
          228,    230,    237,    241], dtype=int64)

In [30]:
print("length of user-id:",len(userid_list))

length of user-id: 828

In [31]:
def get_userid_numeric(user_id):
    userid_index=np.where(userid_list==user_id)
    return userid_index[0][0]

# Convert both user_id and ISBN to the ordered list, i.e., from 0...n-1

In [32]:
Dataframe['user_id_ordered']=Dataframe['user_id'].apply(get_userid_numeric)

In [33]:
Dataframe['user_id_ordered']

0        0
1        1
2        2
3        3
4        4
        ..
8696    96
8697    96
8698    96
8699    96
8700    96
Name: user_id_ordered, Length: 8701, dtype: int64

In [34]:
Dataframe['isbn_ordered']=Dataframe['isbn'].apply(get_isbn_numeric_id)

In [35]:
Dataframe['isbn_ordered']

0          0
1          1
2          2
3          2
4          3
        ...
8696    8046
8697    8047
8698    8048
8699    8049
8700    8050
Name: isbn_ordered, Length: 8701, dtype: int64

In [36]:
Dataframe.head()

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher,user_id_ordered,isbn_ordered
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,0,0
1,276726,155061224,5,Rites of Passage,Judith Rae,2001,Heinle,1,1
2,276727,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2,2
3,278418,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,3,2
4,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,4,3

# Re-index the columns to build a matrix

In [37]:
new_columns=['user_id_ordered','isbn_ordered','rating','book_title','book_author','year_of_publication','publisher']
Dataframe=Dataframe.reindex(columns=new_columns)
Dataframe

,user_id_ordered,isbn_ordered,rating,book_title,book_author,year_of_publication,publisher
0,0,0,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
1,1,1,5,Rites of Passage,Judith Rae,2001,Heinle
2,2,2,0,The Notebook,Nicholas Sparks,1996,Warner Books
3,3,2,0,The Notebook,Nicholas Sparks,1996,Warner Books
4,4,3,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press
...,...,...,...,...,...,...,...
8696,96,8046,7,A Map of the World,Jane Hamilton,1999,Anchor Books/Doubleday
8697,96,8047,0,The Accidental Tourist,Anne Tyler,1994,Berkley Publishing Group
8698,96,8048,0,If Morning Ever Comes,Anne Tyler,1983,Berkley Publishing Group
8699,96,8049,9,Unnatural Exposure,Patricia Daniels Cornwell,1998,Berkley Publishing Group
8700,96,8050,0,Only Love (Magical Love),Erich Segal,1998,Berkley Publishing Group

# Split your data into two sets (training and testing)

In [38]:
from sklearn.model_selection import train_test_split
train_data,test_data=train_test_split(Dataframe,test_size=0.3)

creating two user-book matrices

In [39]:
train_data_matrix=np.zeros([n_users,n_books])
for line in train_data.itertuples():
    train_data_matrix[line[1]-1,line[2]-1]=line[3]

In [40]:
test_data_matrix=np.zeros([n_users,n_books])
for line in test_data.itertuples():
    test_data_matrix[line[1]-1,line[2]-1]=line[3]

using pairwise distances to check cosine similarity

In [41]:
from sklearn.metrics.pairwise import pairwise_distances
user_similarity=pairwise_distances(train_data_matrix,metric='cosine')
item_similarity=pairwise_distances(train_data_matrix.T,metric='cosine')

In [42]:
user_similarity

array([[0., 1., 1., ..., 1., 1., 1.],
       [1., 0., 1., ..., 1., 1., 1.],
       [1., 1., 0., ..., 1., 1., 1.],
       ...,
       [1., 1., 1., ..., 0., 1., 1.],
       [1., 1., 1., ..., 1., 0., 1.],
       [1., 1., 1., ..., 1., 1., 0.]])

In [43]:
item_similarity

array([[0., 1., 1., ..., 1., 1., 1.],
       [1., 0., 1., ..., 1., 1., 1.],
       [1., 1., 0., ..., 1., 1., 1.],
       ...,
       [1., 1., 1., ..., 0., 1., 1.],
       [1., 1., 1., ..., 1., 0., 1.],
       [1., 1., 1., ..., 1., 1., 0.]])

# Making predictions based on user and item variables

In [44]:
def predict(ratings, similarity, type='user'):
    if type == 'user':
        mean_user_rating = ratings.mean(axis=1)
        ratings_diff = (ratings - mean_user_rating[:, np.newaxis]) 
        pred = mean_user_rating[:, np.newaxis] + similarity.dot(ratings_diff) / np.array([np.abs(similarity).sum(axis=1)]).T
    elif type == 'item':
        pred = ratings.dot(similarity) / np.array([np.abs(similarity).sum(axis=1)])     
    return pred

In [45]:
item_prediction=predict(test_data_matrix,item_similarity,type='item')
user_prediction=predict(test_data_matrix,user_similarity,type='user')

In [46]:
item_prediction

array([[0.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.02322981, 0.02322981, 0.02322981, ..., 0.02324545, 0.02322981,
        0.02322981],
       ...,
       [0.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ]])

In [47]:
user_prediction

array([[-0.00073714, -0.00073714,  0.00289043, ..., -0.00073714,
        -0.00073714, -0.00073714],
       [-0.00073714, -0.00073714,  0.00289043, ..., -0.00073714,
        -0.00073714, -0.00073714],
       [ 0.02251778,  0.02251778,  0.02614585, ...,  0.02251778,
         0.02251778,  0.02251778],
       ...,
       [-0.00073714, -0.00073714,  0.00289043, ..., -0.00073714,
        -0.00073714, -0.00073714],
       [-0.00073714, -0.00073714,  0.00289043, ..., -0.00073714,
        -0.00073714, -0.00073714],
       [-0.00073714, -0.00073714,  0.00289043, ..., -0.00073714,
        -0.00073714, -0.00073714]])

# Use RMSE to evaluate the predictions

In [48]:
from sklearn.metrics import mean_squared_error
from math import sqrt
def rmse(prediction, ground_truth):
    prediction = prediction[ground_truth.nonzero()].flatten() 
    ground_truth = ground_truth[ground_truth.nonzero()].flatten()
    return sqrt(mean_squared_error(prediction, ground_truth))

In [49]:
print('User-based CF RMSE: ' + str(rmse(user_prediction, test_data_matrix)))
print('Item-based CF RMSE: ' + str(rmse(item_prediction, test_data_matrix)))

User-based CF RMSE: 7.678649622020115
Item-based CF RMSE: 7.679310516921285

BOTH THE APPROACH YEILDS ALMOST SAME RESULT